[
    {
        "date": "4 Nov 2025",
        "event": "Off-year Elections",
        "location": "United States",
        "introduction": "The off-year elections will include gubernatorial and state legislative races in several states, alongside numerous mayoral and local office contests."
    },
    {
        "date": "7 Nov 2025",
        "event": "G20 Joint Finance and Health Ministerial Meeting",
        "location": "Global",
        "introduction": "Held virtually, this meeting will focus on mobilising financing mechanisms to tackle global health challenges, particularly in the Global South."
    },
    {
        "date": "10–20 Nov 2025",
        "event": "UN Climate Change Conference (COP30)",
        "location": "Global",
        "introduction": "Brazil will host COP30, aiming to achieve significant progress on global climate agreements."
    },
    {
        "date": "11 Nov 2025",
        "event": "Parliamentary Election",
        "location": "Iraq",
        "introduction": "Iraq will hold parliamentary elections amid uncertainty over a possible boycott by Shia cleric Muqtada al-Sadr."
    },
    {
        "date": "11–15 Nov 2025",
        "event": "18th European Public Health Conference 2025",
        "location": "Europe",
        "introduction": "Taking place at Finlandia Hall in Helsinki, the conference will explore how investing in health promotes sustainable development and well-being."
    },
    {
        "date": "16 Nov 2025",
        "event": "Presidential Elections",
        "location": "Chile",
        "introduction": "Chile will elect a new president and legislators, with right-wing candidate Evelyn Matthei favoured to win; a runoff is scheduled for 14 December if required."
    },
    {
        "date": "18 Nov 2025",
        "event": "Local Elections",
        "location": "Denmark",
        "introduction": "Voters across Denmark will elect 2,434 local and 205 regional councillors in all 98 municipalities and five regions."
    },
    {
        "date": "22–23 Nov 2025",
        "event": "G20 Leaders’ Summit",
        "location": "Global",
        "introduction": "South Africa will host the 2025 G20 Summit under the theme 'Solidarity, Equality, and Sustainability,' focusing on climate resilience, debt relief, and inclusive growth."
    },
    {
        "date": "23 Nov 2025",
        "event": "Presidential Election",
        "location": "Bosnia and Herzegovina",
        "introduction": "Early elections in Republika Srpska follow a court ruling that revoked Milorad Dodik’s powers; Dodik has threatened to block the vote, heightening tensions."
    },
    {
        "date": "26 Nov 2025",
        "event": "EU–AU Summit",
        "location": "Global",
        "introduction": "EU and African Union leaders will meet in Luanda, Angola, to discuss peace, trade, green development, digitalisation, and human mobility."
    },
    {
        "date": "30 Nov 2025",
        "event": "General Election",
        "location": "Honduras",
        "introduction": "Honduras will elect a new president, National Congress members, and 20 representatives to the Central American Parliament."
    },
    {
        "date": "5–6 Dec 2025",
        "event": "23rd India–Russia Annual Summit",
        "location": "Russia/India",
        "introduction": "Prime Minister Narendra Modi will host President Vladimir Putin in India for the annual bilateral summit."
    },
    {
        "date": "6–7 Dec 2025",
        "event": "Doha Forum 2025",
        "location": "Global",
        "introduction": "The 2025 Doha Forum will convene under the theme 'Diplomacy, Dialogue and Diversity,' emphasising global cooperation."
    },
    {
        "date": "3 Jan 2026",
        "event": "Sixth Anniversary of the Killing of Gen Qasem Soleimani",
        "location": "Global",
        "introduction": "The anniversary of the U.S. killing of Iranian Gen Qasem Soleimani may trigger increased extremist propaganda activity."
    },
    {
        "date": "15 Jan 2026",
        "event": "ASEAN Summit 2026",
        "location": "Southeast Asia",
        "introduction": "Leaders of the Association of Southeast Asian Nations (ASEAN) will convene to review regional security, economic integration and Indo-Pacific partnerships."
    },
    {
        "date": "1–15 Feb 2026",
        "event": "General Elections",
        "location": "Bangladesh",
        "introduction": "Bangladesh will hold general elections, with the Bangladesh Nationalist Party expected to win and form the next government."
    },
    {
        "date": "24 Feb 2026",
        "event": "Fourth Anniversary of Russia’s Invasion of Ukraine",
        "location": "Ukraine/Russia",
        "introduction": "This anniversary will mark four years since Russia’s full-scale invasion of Ukraine began in 2022."
    },
    {
        "date": "20 Mar 2026",
        "event": "Spring Parliamentary Elections",
        "location": "Australia",
        "introduction": "Australia will hold its federal parliamentary elections, potentially reshaping the government and major policy direction in trade and climate."
    },
    {
        "date": "11 Jun – 19 Jul 2026",
        "event": "FIFA World Cup 2026",
        "location": "United States / Canada / Mexico",
        "introduction": "The 2026 FIFA World Cup will be co-hosted by the U.S., Canada and Mexico — the first time three countries host and the first with 48 teams. :contentReference[oaicite:1]{index=1}"
    },
    {
        "date": "12 Jun – 5 Jul 2026",
        "event": "ICC Women’s T20 World Cup 2026",
        "location": "England",
        "introduction": "The 2026 ICC Women's T20 World Cup will feature 12 teams (an expanded format) and is hosted by England. :contentReference[oaicite:3]{index=3}"
    },
    {
        "date": "4–13 Sep 2026",
        "event": "FIBA Women’s Basketball World Cup 2026",
        "location": "Germany",
        "introduction": "The 2026 FIBA Women's Basketball World Cup will take place in Berlin, with 16 teams participating. :contentReference[oaicite:5]{index=5}"
    },
    {
        "date": "21 Aug – 6 Sep 2026",
        "event": "Women's European Volleyball Championship 2026",
        "location": "Azerbaijan/Czech Republic/Sweden/Turkey",
        "introduction": "The 2026 Women's European Volleyball Championship will be held across four countries for the first time in an even-numbered year. :contentReference[oaicite:7]{index=7}"
    },
    {
        "date": "24 Oct – 8 Nov 2026",
        "event": "General Election",
        "location": "Brazil",
        "introduction": "The Brazil general election is scheduled, potentially reshaping Latin America’s largest democracy. :contentReference[oaicite:9]{index=9}"
    },
    {
        "date": "3 Nov 2026",
        "event": "Midterm Elections",
        "location": "United States",
        "introduction": "The United States will hold its mid-term elections in 2026, which will influence the balance of power in Congress. :contentReference[oaicite:11]{index=11}"
    },
    {
        "date": "10–20 Nov 2026",
        "event": "UN Climate Change Conference (COP31)",
        "location": "Global",
        "introduction": "The next iteration of COP31 will bring global leaders together once again to review progress on the Paris Agreement and global emission targets."
    },
    {
        "date": "28 Nov 2026",
        "event": "State Election",
        "location": "Victoria, Australia",
        "introduction": "The 2026 Victorian state election will be held to elect the 61st Parliament of Victoria, including all 88 seats in the Legislative Assembly and 40 seats in the Legislative Council. :contentReference[oaicite:1]{index=1}"
    },
    {
        "date": "December 2026",
        "event": "Presidential Election",
        "location": "The Gambia",
        "introduction": "The 2026 Gambian presidential election is scheduled for December 2026, where incumbent Adama Barrow is running for a third term. :contentReference[oaicite:4]{index=4}"
    },
    {
        "date": "22 Dec 2026",
        "event": "General Election",
        "location": "South Sudan",
        "introduction": "The 2026 South Sudanese general election, long-delayed, will finally take place in South Sudan on 22 December 2026, including the presidential election and legislative assembly contests. :contentReference[oaicite:6]{index=6}"
    }
]