[
    {
        "date": "1 Jul - 31 Dec 2024",
        "event": "Hungarian Council presidency",
        "location": "EU",
        "introduction": "Hungary holds the rotating presidency of the Council of the EU."
    },
    {
        "date": "11-24 Nov 2024",
        "event": "The 29th Conference of the Parties (COP29) to the UN Framework Convention on Climate Change (UNFCCC)",
        "location": "Global",
        "introduction": "Baku will host COP29 after Azerbaijan’s selection as host after Russia vetoed any bid by an EU country."
    },
    {
        "date": "24 Nov 2024",
        "event": "Presidential election",
        "location": "Romania",
        "introduction": "Surveys show that the current leading candidates are not backed by the governing Social Democrats (PSD) and the Liberals (PNL). PSD and PNL will likely agree on a joint candidate ahead of the vote, with current Prime Minister Marcel Ciolacu of the PSD being the most likely candidate. A second round will be held on 8 December."
    },
    {
        "date": "24 Nov 2024",
        "event": "Legislative elections",
        "location": "Guinea-Bissau",
        "introduction": "Opposition coalition PAI-Terra Ranka is likely to win a majority of seats, as it did at the last elections in 2023."
    },
    {
        "date": "25-30 Nov 2024",
        "event": "ICA Global Cooperative Conference and General Assembly",
        "location": "Global",
        "introduction": "The official launch of the International Year of Cooperatives will take place in New Delhi (India) during the ICA Global Cooperative Conference and General Assembly. Global leaders will seek to inspire co-operatives worldwide . "
    },
    {
        "date": "25 Nov- 1 Dec 2024",
        "event": "Global Plastics Treaty final negotiations",
        "location": "Global",
        "introduction": "The final negotiations are scheduled to take place in Busan (South Korea). This fifth and final session of the Intergovernmental Negotiating Committee (INC) on Plastic Pollution (INC-5) is intended to finalise the text of the treaty."
    },
    {
        "date": "27 Nov 2024",
        "event": "Regional elections, including Jakarta",
        "location": "Indonesia",
        "introduction": "Regional elections are scheduled, including to elect the Jakarta governor to a five-year term."
    },
    {
        "date": "27 Nov 2024",
        "event": "General election",
        "location": "Namibia",
        "introduction": "The death of former president Hage Geingob (2015-24) in February 2024 is unlikely to undermine the succession process of Vice-President Netumbo Nandi-Ndaitwah, who will stand as the presidential candidate for the ruling South West Africa People’s Organisation (SWAPO). "
    },
    {
        "date": "30 Nov 2024",
        "event": "Snap parliamentary elections",
        "location": "Iceland",
        "introduction": "The governing parties, a big-tent, three-party coalition between the Independence Party, the Left-Green Movement and the Progressive Party, are likely to lose power to the centre-left opposition Social Democratic Alliance (SDA)."
    },
    {
        "date": "December 2024",
        "event": "South Africa ascends to G20 Presidency",
        "location": "Global",
        "introduction": "South Africa will take over from Brazil."
    },
    {
        "date": "Early-Mid December 2024",
        "event": "GCC leaders’ summit",
        "location": "GCC",
        "introduction": "The Gulf Cooperation Council (GCC) alliance is due to hold its annual Supreme Council leaders’ summit to agree shared policy positions across member countries to drive collective policymaking and co-ordination over the coming year."
    },
    {
        "date": "1 Dec 2024",
        "event": "OPEC+ to hold joint ministerial monitoring committee meeting (JMMC)",
        "location": "Global",
        "introduction": "OPEC+ members will discuss the planned easing of production quotas. These are scheduled to begin  in December after a two-month delay which was prompted by record low prices in crude oil in August-September 2024."
    },
    {
        "date": "1 Dec 2024",
        "event": "Legislative elections",
        "location": "Romania",
        "introduction": "The coalition government of the leftist Social Democrats (PSD) and the centre-right Liberals (PNL) will likely fall short of securing an outright majority in parliament in December. Therefore, a coalition with a third party will likely be necessary to form a majority government."
    },
    {
        "date": "2-13 Dec 2024",
        "event": "UNCCD Conference of Parties 16th session (COP16)",
        "location": "Global",
        "introduction": "Saudi Arabia will host the UN Convention to Combat Desertification COP16 in Riyadh. "
    },
    {
        "date": "6-8 Dec 2024",
        "event": "2024 IISS Manama Security Dialogue",
        "location": "Global",
        "introduction": "The International Institute for Strategic Studies will bring together experts, policymakers and decisionmakers to discuss the most pressing regional security issues and to share policy responses."
    },
    {
        "date": "7 Dec 2024",
        "event": "General elections",
        "location": "Ghana",
        "introduction": "The opposition National Democratic Congress (NDC) and its presidential candidate former president John Dramani Mahama (2012-17) are likely to win the polls, defeating incumbent vice president Mahamadu Bawumia, who is the candidate of the ruling New Patriotic Party."
    },
    {
        "date": "7-8 Dec 2024",
        "event": "2024 Doha Forum",
        "location": "Qatar",
        "introduction": "The 2024 summit will have the theme of “The Innovation Imperative” and include a focus on the need for a shift towards more open, collaborative and cross-sectoral models of innovation."
    },
    {
        "date": "15-19 Dec 2024",
        "event": "UN Internet Governance Forum",
        "location": "Global",
        "introduction": "The UN Internet Governance Forum (IGF) serves to bring various stakeholder together for discussions on digital public policy. The forum does not have negotiated outcomes."
    },
    {
        "date": "January 2025",
        "event": "Canada ascends to G7 Presidency",
        "location": "Global",
        "introduction": "Canada will take over from Italy."
    },
    {
        "date": "20 Jan 2025",
        "event": "Presidential inauguration",
        "location": "US",
        "introduction": "The winners of the 2024 presidential election will be inaugurated as President and Vice President of the United States."
    },
    {
        "date": "9 Feb 2025",
        "event": "General election",
        "location": "Ecuador",
        "introduction": "A new president and 137 members of the National Assembly (legislature) will be elected for a four-year term. President Daniel Noboa and left-leaning Luisa González, who came second in the 2023 snap elections, are the likely front runners in the presidential race, which is set to be highly competitive and uncertain. Despite modest agenda results during his government, Noboa will likely be re-elected by a tight margin in a run-off on 13 April."
    },
    {
        "date": "10-11 Feb 2025",
        "event": "AI Action Summit",
        "location": "Global",
        "introduction": "The third summit of its kind will focus on public interest AI; the future of work; innovation and culture; trust in AI; and global AI governance. It will be held in Paris (France)."
    },
    {
        "date": "28 Feb - 30 Mar 2025",
        "event": "Muslim holy month of Ramadan",
        "location": "Global",
        "introduction": "Terrorism threats and propaganda can be elevated in some regions during Ramadan. In addition, protests have occurred in Muslim-majority countries during Ramadan and the celebration of Eid al-Fitr (marking the end of Ramadan). Ramadan could also trigger anti-Muslim hate crimes or sentiment in some non-Muslim majority countries. The Middle East conflicts will likely drive increased threats during Ramadan in 2025."
    },
    {
        "date": "29 Mar 2025",
        "event": "Day of the Young Combatant",
        "location": "Chile",
        "introduction": "The day commemorates the 1985 killings of two brothers by the police. Violent protests in Santiago and other cities traditionally occur on the day."
    },
    {
        "date": "12-20 Apr 2025",
        "event": "Jewish religious holiday Passover (Pesach)",
        "location": "Global",
        "introduction": "Threats against Jewish communities, people and assets are likely to be elevated in some countries during the Passover religious holiday. Islamist extremist groups have planned or conducted attacks targeting Passover celebrations in Israel. The Israel-Hamas conflict is likely to increase the intent of Islamist and right-wing extremists to target Jewish communities and religious assets during Passover."
    },
    {
        "date": "20 Apr 2025",
        "event": "Christian holiday of Easter Sunday",
        "location": "Global",
        "introduction": "The Easter religious holiday is not generally associated with elevated violent extremist threats, though attacks have targeted religious services in some countries (notably in Sri Lanka in 2019)."
    },
    {
        "date": "1 May 2025",
        "event": "May Day",
        "location": "Global",
        "introduction": "May Day is typically celebrated by socialist and communist political movements and is a global day of action for anti-capitalist, anarchist and other left-wing activists. May Day protests in parts of Europe and North America involve vandalism, property damage and clashes with law enforcement and right-wing counter-demonstrators."
    },
    {
        "date": "12 May 2025",
        "event": "General election",
        "location": "Philippines",
        "introduction": "All 318 seats in the House of Representatives (lower house) and 12 of the 24 seats in the Senate (upper house) will be contested. Local elections will also be held for the executive and legislative branches."
    },
    {
        "date": "15 May 2025",
        "event": "Nakba Day",
        "location": "Israel, Palestinian Territories",
        "introduction": "Palestinians commemorate Nakba (“catastrophe”) – a term they use to refer to when more than 700,000 Arabs fled or were expelled during the creation of Israel. The Middle East conflicts will drive higher turnouts at related protests globally. "
    },
    {
        "date": "June 2025",
        "event": "Deadline for a Global Pandemic Treaty",
        "location": "Global",
        "introduction": "WHO member states have extended the mandate of the Intergovernmental Negotiating Body, established in December 2021, to finish its work to negotiate a Global Pandemic Treaty."
    },
    {
        "date": "June 2025",
        "event": "G7 Leaders’ Summit",
        "location": "Global",
        "introduction": "Canada will host the G7 Leaders Summit in Kananaskis (Alberta)."
    },
    {
        "date": "24-25 Jun 2025",
        "event": "North Atlantic Treaty Organization (NATO) Summit",
        "location": "Global",
        "introduction": "The Netherlands for the first time will host the NATO Summit. It will take place in The Hague. "
    },
    {
        "date": "1 July 2025",
        "event": "Adopts the Euro",
        "location": "Bulgaria",
        "introduction": "Sofia is expected to adopt the euro and become the 21st eurozone member. In July 2024, the Bulgarian parliament passed the relevant bill on its first reading."
    },
    {
        "date": "September 2025",
        "event": "First crewed mission to the Moon since 1972",
        "location": "Global",
        "introduction": "Artemis II, the first crewed mission to the Moon since 1972 and second mission of the Artemis Program, is scheduled to launch no earlier than September 2025."
    },
    {
        "date": "September 2025",
        "event": "Federal elections",
        "location": "Germany",
        "introduction": "The far right is expected to showcase its growing support during the national elections. It made significant gains in three state elections in 2024."
    }
]